## [starter kit](https://nodevops.app.spacelift.io/stack/starter-kit/run/01KA6MDWEEBRBHZ4NZEFXXDYEC) plan logs

<details>
<summary>Click here to expand</summary>

```
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Planning changes with 0 custom hooks...
random_password.context-password: Refreshing state... [id=none]
random_password.stack-password: Refreshing state... [id=none]
spacelift_context.managed: Refreshing state... [id=managed-context]
spacelift_policy.push: Refreshing state... [id=ignore-commits-outside-the-project-root]
data.spacelift_current_stack.this: Reading...
spacelift_policy.login: Refreshing state... [id=devops-are-admins]
spacelift_policy.plan: Refreshing state... [id=enforce-password-strength]
data.spacelift_ips.ips: Reading...
spacelift_policy.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency]
data.spacelift_current_stack.this: Read complete after 0s [id=starter-kit]
data.spacelift_ips.ips: Read complete after 0s [id=spacelift-ips]
spacelift_environment_variable.context-plaintext: Refreshing state... [id=context/managed-context/CONTEXT_PUBLIC]
spacelift_mounted_file.context-secret-file: Refreshing state... [id=context/managed-context/context-secret-password.json]
spacelift_environment_variable.context-writeonly: Refreshing state... [id=context/managed-context/CONTEXT_SECRET]
spacelift_policy_attachment.trigger-self: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01KA6K8B61CFG6P0TZ9C471B20]
spacelift_mounted_file.context-plaintext-file: Refreshing state... [id=context/managed-context/context-plaintext-file.json]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # spacelift_context_attachment.managed will be created
  + resource "spacelift_context_attachment" "managed" {
      + context_id = "managed-context"
      + id         = (known after apply)
      + priority   = 0
      + stack_id   = (known after apply)
    }

  # spacelift_environment_variable.stack-plaintext will be created
  + resource "spacelift_environment_variable" "stack-plaintext" {
      + checksum   = (known after apply)
      + id         = (known after apply)
      + name       = "STACK_PUBLIC"
      + stack_id   = (known after apply)
      + value      = (sensitive value)
      + write_only = false
    }

  # spacelift_environment_variable.stack-writeonly will be created
  + resource "spacelift_environment_variable" "stack-writeonly" {
      + checksum   = (known after apply)
      + id         = (known after apply)
      + name       = "STACK_SECRET"
      + stack_id   = (known after apply)
      + value      = (sensitive value)
      + write_only = true
    }

  # spacelift_mounted_file.stack-plaintext-file will be created
  + resource "spacelift_mounted_file" "stack-plaintext-file" {
      + checksum      = (known after apply)
      + content       = (sensitive value)
      + id            = (known after apply)
      + relative_path = "stack-plaintext-ips.json"
      + stack_id      = (known after apply)
      + write_only    = false
    }

  # spacelift_mounted_file.stack-secret-file will be created
  + resource "spacelift_mounted_file" "stack-secret-file" {
      + checksum      = (known after apply)
      + content       = (sensitive value)
      + id            = (known after apply)
      + relative_path = "stack-secret-password.json"
      + stack_id      = (known after apply)
      + write_only    = true
    }

  # spacelift_policy_attachment.plan will be created
  + resource "spacelift_policy_attachment" "plan" {
      + id        = (known after apply)
      + policy_id = "enforce-password-strength"
      + stack_id  = (known after apply)
    }

  # spacelift_policy_attachment.push will be created
  + resource "spacelift_policy_attachment" "push" {
      + id        = (known after apply)
      + policy_id = "ignore-commits-outside-the-project-root"
      + stack_id  = (known after apply)
    }

  # spacelift_policy_attachment.trigger will be created
  + resource "spacelift_policy_attachment" "trigger" {
      + id        = (known after apply)
      + policy_id = "trigger-stacks-that-declare-an-explicit-dependency"
      + stack_id  = (known after apply)
    }

  # spacelift_stack.managed will be created
  + resource "spacelift_stack" "managed" {
      + administrative                   = false
      + allow_run_promotion              = true
      + autodeploy                       = true
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + description                      = "Your first stack managed by Terraform"
      + enable_local_preview             = false
      + enable_sensitive_outputs_upload  = true
      + enable_well_known_secret_masking = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "depends-on:starter-kit",
          + "managed",
        ]
      + manage_state                     = true
      + name                             = "Managed stack"
      + project_root                     = "managed-stack"
      + protect_from_deletion            = false
      + repository                       = "spacelift-terraform-starter"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_version                = (known after apply)
      + terraform_workflow_tool          = (known after apply)

      + github_enterprise {
          + is_default = (known after apply)
          + namespace  = "nodevops"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Changes are GO
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Uploading the list of managed resources...
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Please be aware that the run changes calculation includes output changes.
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Resource list upload is GO
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Generating JSON representation of the plan...
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] JSON representation is GO
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] Loading custom plan policy inputs...
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] 0 custom plan policy inputs found
[01KA5YJRWR0DFY6XBM5WHQQ4ZH] No plan policies to evaluate
```

</details>